app/views/tour_mailer/tour_requested.html.erb

SELECT "user_informations".* FROM "user_informations" WHERE "user_informations"."user_id" = 14 LIMIT 1
---
	  <b>Name:</b>
	  <%= @user.user_information.first_name + " " + @user.user_information.last_name %>

SELECT "tours".* FROM "tours" WHERE "tours"."id" = ? LIMIT 1  [["id", "2"]]
---
	  <b>Options:</b>
	  <%= @user.tour.options.map(&:titleize).join(", ") %>