app/views/users/show.html.erb

SELECT "user_informations".* FROM "user_informations" WHERE "user_informations"."user_id" = 12 LIMIT 1
---
	  <b>Name:</b>
	  <%= @user.user_information.first_name + " " + @user.user_information.last_name %>

SELECT "tours".* FROM "tours" WHERE "tours"."user_id" = 12 LIMIT 1
---
	  <b>Options:</b>
	  <%= @user.tour.options.map(&:titleize).join(", ") %>