app/controllers/tours_controller.rb

  def index
    @tours = Tour.all
---
SELECT "tours".* FROM "tours"

  def create
    @tour = Tour.new(params[:tour])
    @tour.user_id = session[:user].id
    respond_to do |format|
      if @tour.save
---
INSERT INTO "tours" ("additional_questions", "created_at", "options", "preferred_date", "rating", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @tour = Tour.find(params[:id])

    respond_to do |format|
      if @tour.update_attributes(params[:tour])
---
SELECT "tours".* FROM "tours" WHERE "tours"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "tours" SET "rating" = 1, "updated_at" = '2012-08-10 20:28:27.260082', "options" = '---