app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "user_informations".* FROM "user_informations" WHERE "user_informations"."user_id" = 10 LIMIT 1
SELECT "tours".* FROM "tours" WHERE "tours"."user_id" = 12 LIMIT 1
---
  def show
    @user = User.find(params[:id])
    if params[:verification] == @user.verification
      session[:user] = @user
      if @user.user_information.blank?
        return redirect_to new_user_information_path
      elsif @user.tour.blank?

INSERT INTO "users" ("created_at", "email", "ip_address", "updated_at", "verification") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])
    @user.ip_address = request.remote_ip
    respond_to do |format|
      if @user.save