app/controllers/user_informations_controller.rb

  def index
    @user_informations = UserInformation.all
---
SELECT "user_informations".* FROM "user_informations"

  def show
    @user_information = UserInformation.find(params[:id])
---
SELECT "user_informations".* FROM "user_informations" WHERE "user_informations"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @user_information = UserInformation.find(params[:id])
---
SELECT "user_informations".* FROM "user_informations" WHERE "user_informations"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @user_information = UserInformation.new(params[:user_information])
    @user_information.user_id = session[:user].id
    respond_to do |format|
      if @user_information.save
---
INSERT INTO "user_informations" ("created_at", "first_name", "last_name", "phone_number", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Fri, 10 Aug 2012 17:08:45 UTC +00:00], ["first_name", nil], ["last_name", nil], ["phone_number", nil], ["updated_at", Fri, 10 Aug 2012 17:08:45 UTC +00:00], ["user_id", nil]]

  def update
    @user_information = UserInformation.find(params[:id])
---
SELECT "user_informations".* FROM "user_informations" WHERE "user_informations"."id" = ? LIMIT 1  [["id", "1"]]

  def destroy
    @user_information = UserInformation.find(params[:id])
    @user_information.destroy
---
SELECT "user_informations".* FROM "user_informations" WHERE "user_informations"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "user_informations" WHERE "user_informations"."id" = ?  [["id", 1]]